Revit 2026 API

# FamilyManagerRemoveParameter Method

---

Remove an existing family parameter from the family.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveParameter(
	FamilyParameter familyParameter
)
```
```vb
Public Sub RemoveParameter (
	familyParameter As FamilyParameter
)
```
```cpp
public:
void RemoveParameter(
	FamilyParameter^ familyParameter
)
```
```fsharp
member RemoveParameter :
        familyParameter : FamilyParameter -> unit
```

#### Parameters

familyParameter FamilyParameter
    The family parameter.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter. |
| InvalidOperationException | Thrown when the family parameter deletion failed. |

Only family and shared parameters may be removed, built-in parameters may not be removed. If the parameter is used in any formulas, those formulas will be automatically removed along with the parameter.

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace